//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡
//!	@file	AttackingState.cpp
//!
//!	@brief	攻撃状態クラスのソースファイル
//!
//!	@date	2017/08/28
//!
//!	@author	Masayuki Fuseya
//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡

// ヘッダファイルの読み込み ================================================
#include "AttackingState.h"


//**********************************************************************
//!	@brief		初期化する
//!
//!	@param[in]	キャラクター
//!
//!	@return		なし
//**********************************************************************
void AttackingState::Initialize(Character* character)
{
	m_character = character;
}



//**********************************************************************
//!	@brief		実行する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void AttackingState::Execute()
{
	m_character->UpdateAttacking();
}



//**********************************************************************
//!	@brief		描画する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void AttackingState::Render()
{
	m_character->RenderAttacking();
}
