//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡
//!	@file	StandingState.cpp
//!
//!	@brief	起立状態クラスのソースファイル
//!
//!	@date	2017/08/28
//!
//!	@author	Masayuki Fuseya
//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡

// ヘッダファイルの読み込み ================================================
#include "StandingState.h"


//**********************************************************************
//!	@brief		初期化する
//!
//!	@param[in]	キャラクター
//!
//!	@return		なし
//**********************************************************************
void StandingState::Initialize(Character* character)
{
	m_character = character;
}



//**********************************************************************
//!	@brief		実行する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void StandingState::Execute()
{
	m_character->UpdateStanding();
}



//**********************************************************************
//!	@brief		描画する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void StandingState::Render()
{
	m_character->RenderStanding();
}
