//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡
//!	@file	WeakEnemy.cpp
//!
//!	@brief	弱い敵のクラスのソースファイル
//!
//!	@date	2018/01/18
//!
//!	@author	Masayuki Fuseya
//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡

// ヘッダファイルの読み込み ================================================
#include "WeakEnemy.h"


//**********************************************************************
//!	@brief		コンストラクタ
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
WeakEnemy::WeakEnemy()
{
}



//**********************************************************************
//!	@brief		初期化する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void WeakEnemy::Initialize()
{
	// ライフを初期化する
	m_life = 20;

	// モデルを読み込む
	LoadModel(L"fellguard");

	// 180度回転させて奥を向くようにする
	SetRotation(DirectX::SimpleMath::Vector3(0.0f, DirectX::XM_PI, 0.0f));

	Enemy::Initialize();
}
