//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡
//!	@file	PlayerLeftUpperArm.cpp
//!
//!	@brief	プレイヤーの左上腕のソースファイル
//!
//!	@date	2017/08/02
//!
//!	@author	Masayuki Fuseya
//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡

// ヘッダファイルの読み込み ================================================
#include "PlayerLeftUpperArm.h"


//**********************************************************************
//!	@brief		コンストラクタ
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
PlayerLeftUpperArm::PlayerLeftUpperArm()
{
}



//**********************************************************************
//!	@brief		初期化する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void PlayerLeftUpperArm::Initialize()
{
	LoadModel(L"KnightLeftUpperArm");
}



//**********************************************************************
//!	@brief		更新する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void PlayerLeftUpperArm::Update()
{
}



//**********************************************************************
//!	@brief		描画する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void PlayerLeftUpperArm::Render()
{
	Obj3D::Render();
}
