//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡
//!	@file	PlayerRightUpperArm.cpp
//!
//!	@brief	プレイヤーの右上腕のソースファイル
//!
//!	@date	2017/08/02
//!
//!	@author	Masayuki Fuseya
//≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡

// ヘッダファイルの読み込み ================================================
#include "PlayerRightUpperArm.h"


//**********************************************************************
//!	@brief		コンストラクタ
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
PlayerRightUpperArm::PlayerRightUpperArm()
{
}



//**********************************************************************
//!	@brief		初期化する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void PlayerRightUpperArm::Initialize()
{
	LoadModel(L"KnightRightUpperArm");
}



//**********************************************************************
//!	@brief		更新する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void PlayerRightUpperArm::Update()
{
}



//**********************************************************************
//!	@brief		描画する
//!
//!	@param[in]	なし
//!
//!	@return		なし
//**********************************************************************
void PlayerRightUpperArm::Render()
{
	Obj3D::Render();
}
